[[["c395e648-eac8-456d-93b5-062b84b850a8",{"pageContent":"     \n \nSUBCONTRACTOR BUSINESS ASSOCIATE AGREEMENT\n \n \nThis Subcontractor Business Associate Agreement (“BAA”), dated as of N\november 28\n, 2022 (“Effective \nDate”), is entered into by and between Beth Israel Lahey Health, Inc. (“Business Associate”) and Glykka, LLC \nd/b/a Signeasy (“Subcontractor”).  Subcontractor and Business Associate may be referred to herein \ncollectively as the “Parties” or individually as “Party”.\n \n \nWHEREAS, Business Associate, as a component of Beth Israel Lahey Health, has among its purposes \nproviding services to or on behalf of Beth Israel Lahey Health’s Covered Entity subsidiaries (collectively \n“Covered Entity”);\n \n \nWHEREAS, the Parties have entered into one or more agreements, including but not limited to the \nonline p\nurchase\n dated \nNovember 28, 2022 \n(each a “Service Agreement”) pursuant to which Subcontractor \nagrees to provide certain services to or on behalf of Business Associate (the “Services”). \n \n \nWHEREAS, in the course of providing the Services, Subcontractor may create, receive, maintain, or \ntransmit on behalf of Business Associate, or otherwise receive from Business Associate, certain Protected \nHeath Information (“PHI”).  \n \n \n \nWHEREAS, the Parties are committed to complying with the Privacy Regulations and the  Se\ncurity \nRegulations (as such terms are defined below) under the Health Insurance Portability and Accountability \nAct of 1996 and its implementing regulations and guidance issued by the Secretary (as defined below), all as \namended from time to time (“HIPAA”) and \nthe Health Information Technology for Economic and Clinical \nHealth Act, as incorporated in the American Recovery and Reinvestment Act of 2009, and its implementing \nregulations and guidance issued by the Secretary, all as amended from time to time (“HIT\nECH Act”); and\n \n \n \nWHEREAS, this BAA sets forth the terms and conditions pursuant to which PHI that is created, \nreceived, maintained, or transmitted by Subcontractor on behalf of Business Associate or that is disclosed \nby Business Associate to Subcontractor shall be handled between and among Business Associate, \nSubcontractor and third parties during the term of the Service Agreement and following its termination.\n \n \n \nNOW, THEREFORE, for good and valuable consideration, the receipt and sufficiency of which are \nhereby acknowledged, the Parties agree as follows:\n \n1.\n \nDefinitions\n \na)\n \nDefinitions. \n(i)\n \nThe following terms used in this BAA shall have the same meaning as those terms have in the \nHIPAA Rules: Breach, Data Aggregation, Designated Record Set, Disclosure, Electronic \nProtected Health Information, Health Care Operations, Individual, Minimum Necessary, \nProtected Health Information, Required By Law, Secretary, Security Incident, Subcontractor, \nUnsecured Protected Health Information, and Use.\n \n \n(ii)\n \nThe following terms used in t\nhis BAA shall have the same meaning as those terms have in the \nMassachusetts Data Security Rules: Breach of Security, and Personal Information.\n \n \n \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":1}}}],["959f986b-eb5d-42c4-b6f9-7315b8e1b593",{"pageContent":"2 \n \nb)\n \nSpecific Definitions\n.\n \n(i)\n \nHIPAA Rules\n.    “HIPAA Rules” shall mean the Health Insurance Portability and \nAccountability Act of 1996, Public Law 104-191 and its implementing regulations \nand Subtitle D of the Health Information Technology for Economic and Clinical \nHealth Act, which is Title XIII of the American Recovery and Reinvestment Act of \n2009 (Public Law 111-005), and its implementing regulations, including, but not \nlimited to, the privacy, security, breach notification, and enforcement rules at 45 \nCFR Part 160 and Part 164.\n \n(ii)\n \nMassachusetts Data Security Rules. “Massachusetts Data Security Rules” shall \nmean: \nMassachusetts General Laws chapter 93H; and 201 Code of Massachusetts \nRegulations 17.00 et seq.\n \n(iii)\nPart 2\n. “Part 2” shall mean the Federal Confidentiality of Alcohol and Drug Abuse \nPatient Records law and regulations, 42 USC §290dd-\n2 and 42 CFR Part 2.\n \n2.\n \nObligations and Activities of Subcontractor\n \nSubcontractor agrees to:\n \na)\n \nNot Use or Disclose PHI other than as permitted or required by this BAA or as Required by Law;\n \nb)\n \nUse appropriate safeguards, and comply with Subpart C of 45 CFR Part 164 with respect to \nElectronic Protected Health Information, to prevent the Use or Disclosure of PHI other than as \nexpressly provided for by this BAA;\n \nc)\n \nReport to Business Associate any Use or Disclosure of PHI not expressly provided for by this BAA, or \nany Security Incident, of which it becomes aware, including reporting Breaches of Unsecured \nProtected Health Information. Oral reports shall be made within two (2) business days following \ndiscovery and shall be followed promptly by written report (within ten (10) calendar days of\n \ndiscovery).  Subcontractor shall cooperate with Business Associate with respect to disclosure of \nsuch Breach or Security Incident; provided, however, that Business Associate shall have sole control \nover the timing and method of providing notice to the affected individual(s).  Subcontractor shall \nreimburse Business Associate for its reasonable costs and expenses in providing notification and \ncosts of mitigating the harm (which may include the costs of obtaining credit monitoring services \nand identity theft insurance) for affected individuals;\n \nd)\n \nMitigate, to the extent practicable, any harmful effect that is known to Subcontractor of a Use or \nDisclosure of PHI by Subcontractor in violation of the requirements of this BAA;\n \ne)\n \nIn accordance with 45 CFR 164.502(e)(1)(ii) and 164.308(b)(2), if applicable, ensure that any \nSubcontractors that create, receive, maintain, or transmit PHI on behalf of Subcontractor agree in \nwriting to the same restrictions, conditions, and requirements that apply to Subcontractor with \nrespect to such information, and third party beneficiary rights to Business Associate in the event \nthe third party breaches such a business associate \nagreement or otherwise causes harm to Business \nAssociate. Upon request, Subcontractor will provide copies of\n any such business associate \nagreements to Business Associate;\n \nf)\n \nPromptly make available PHI in a Designated Record Set to Business Associate as necessary to \nsatisfy Business Associate’s obligations under 45 CFR 164.524 and in the event any Individual \nrequ\nests access to PHI directly from Subcontractor, forward such request to Business Associate ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":2}}}],["6bff93ca-d388-40a5-84c7-4460834c378d",{"pageContent":"3 \n \nwithin five (5) calendar days so that Business Associate can respond to such Individual in \naccordance with 45 C.F.R. § 164.524;\n \ng)\n \nTo the extent applicable, \n     \nmake any amendment(s) to PHI in a Designated Record Set as directed \nor agreed to by Business Associate pursuant to 45 CFR 164.526 within seven (7) calendar days or \ntake other measures as necessary to satisfy Business Associate’s obligations under 45 CFR 16\n4.526;\n \nh)\n \nMaintain and make available the information required to provide an accounting of disclosures to \nBusiness Associate as necessary to satisfy Business Associate’s obligations under 45 CFR 164.528 \nwithin seven (7) calendar days. Alternatively, if Busine\nss Associate responds to an individual’s \nrequest for an accounting of disclosures made through an Electronic Health Record by providing the \nrequesting individual with a list of all business associates acting on behalf of Business Associate, \nthen Subcontrac\ntor shall provide such an accounting directly to the requesting individual in the \ntime and manner specified by the HITECH Act;\n \ni)\n \nTo the extent Subcontractor is to carry out one or more of Business Associate's or Covered Entity’s \nobligations under Subpart E o\nf 45 CFR Part 164, comply with the requirements of Subpart E that \napply to Business Associate and/or Covered Entity in the performance of such obligation(s); \n \nj)\n \nMake its internal practices, books, and records available to the Secretary for purposes of \ndetermining compliance with the HIPAA Rules in a time and manner designated by Business \nAssociate or the Secretary; \n \nk)\n \nComply with, and ensure that its Subcontractors (if any) agree to comply with, all the requirements \nof the HIPAA Rules at all times during th\ne term of this Agreement and during the survival of any \nprovisions hereof, all of which shall be applicable to Subcontractor and which are incorporated \nherein in their entirety.\n \nl)\n \nProvide training for its employees, agents, representatives, and subcontractor\ns on the \nrequirements of the HIPAA Rules and the Massachusetts Data Security Rules, which includes the \npermitted uses and disclosures of Protected Health Information and Personal Information.\n \nm)\n \nProtect and maintain the confidentiality, security and integrity\n of Personal Information in the \nmanner provided for under, and otherwise comply with all applicable provisions of the \nMassachusetts Data Security Rules.  Without limiting the generality of the foregoing, Subcontractor \nshall implement and maintain appropria\nte administrative, technical and physical safeguards and \nother security measures necessary to maintain the confidentiality, security and integrity of Business \nAssociate Personal Information, including but not limited to a comprehensive written information \nsecurity program that is consistent with industry standards, that reflects the size and type of \nSubcontractor’s business as well as the volume and nature of its stored data.  \nWith respect to all \nProtected Health Information that is Electronically Transmitted or Electronically Maintained by \nBusiness Associate or one of its subcontractors will be maintained within the borders of the United \nStates and will not be transmitted or otherwise leave the boundaries of the United States.\n  At all \ntimes, Subcontractor\n shall remain responsible and liable for any act or omission affecting Business \nAssociate Personal Information by any of its affiliates, agents or subcontractors as if such action or \nomission were performed by Subcontractor. Subcontractor will report to th\ne Business Associate any \nsuspected Breach of Security with respect to any Personal Information created or received by \nSubcontractor from or on behalf of Business Associate of which Subcontractor becomes aware.  \nOral reports shall be made within two (2) bus\niness days following discovery, and shall be followed ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":3}}}],["0d459d3c-eda4-4d39-abcd-9d989173a955",{"pageContent":"4 \n \npromptly by a written report based on subsequently developed information. This provision shall \nsurvive termination of the Agreement.\n \nn)\n \nSubcontractor shall ensure that its activities for Business Associate\n are conducted in accordance \nwith reasonable policies and procedures, as specified in the Identity Theft Red Flag Rules \npromulgated under the Fair and Accurate Credit Transactions Act of 2003 (the “Red Flag Rules”), \nwhich are designed to detect, prevent and mitigate the risk of identity theft and to detect any \nrelevant pattern, practice, or specific activity that indicates the possible existence of identity theft \n(each a “Red Flag”) that may arise in the performance of services on behalf of Business Associate. \nSubcontractor shall report to Business Associate any Red Flag incident of which it becomes aware.  \nSuch reports shall be made orally within two (2) days from the date that Subcontractor becomes \naware of the Red Flag incident, and shall be followed promptly by a written report based on \nsubsequently developed information.  Such written report by Subcontractor shall include: (i) a \ndescription of the Red Flag incident; (ii) a description of any threat of identity theft that may occur \nas a result of such inc\nident; and (iii) the steps it has taken to mitigate any potential harm resulting \nfrom such incident.\n \no)\n \nAcknowledge that Covered Entity is a member of an “organized health care arrangement,” as that \nterm is defined at by the HIPAA Rules.  The current composit\nion of this organized health care \narrangement (“OHCA”), which may be amended from time to time, includes the entities listed on \nExhibit A hereto (collectively, as amended from time to time, “OHCA Entities”).  To the extent \nSubcontractor creates or receives\n protected health information from or on behalf of one or more of \nthe OHCA Entities, the terms of this Agreement shall apply unless and until such OHCA Entity opts \nout of this Agreement, which an OHCA Entity may do at its sole discretion.  If this Agreement \napplies to transactions between an OHCA Entity and Subcontractor, such OHCA Entity shall be \nconsidered a third party beneficiary of this Agreement with the right to enforce the terms of this \nAgreement.  If an OHCA Entity opts out of this Agreement, anoth\ner agreement addressing the \nprivacy and security of the OHCA Entity’s information may be required by the OHCA Entity before \nany further transactions occur between the OHCA Entity and Subcontractor.\n \n3.\n \nPermitted Uses and Disclosures by Subcontractor\n \na)\n \nSubcontractor may Use or Disclose PHI only to perform services on behalf of Business Associate and \nas otherwise expressly permitted by this BAA.  All other Uses and Disclosures are prohibited.  \n \nb)\n \nSubcontractor may Use or Disclose PHI as Required by Law.\n \nc)\n \nSub\ncontractor agrees to make Uses and Disclosures and requests for PHI consistent with Business \nAssociate’s Minimum Necessary policies and procedures.\n \nd)\n \nExcept for the specific Uses and Disclosures set forth in Sections 3(e), 3(f), and 3(g), below, \nSubcontracto\nr may not Use or Disclose PHI in a manner that would violate Subpart E of 45 CFR Part \n164 if done by Business Associate. \n \ne)\n \nSubcontractor may Use PHI for the proper management and administration of Subcontractor or to \ncarry out the legal responsibilities of \nSubcontractor, provided that such uses are permitted under \nthe HIPAA Rules, the Massachusetts Data Security Rules and Part 2.\n \nf)\n \nSubcontractor may Disclose PHI for the proper management and administration of Subcontractor \nor to carry out the legal responsibilities of Subcontractor, provided the Disclosures are Required by ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":4}}}],["1df9fcc8-a618-4211-8eb7-1a2b3ecc51aa",{"pageContent":"5 \n \nLaw, or Subcontractor has entered into a business associate agreement with the third party which \nincludes reasonable assurances from the person to whom the information is Disclosed that the \ninformation will remain confidential and used or further disclosed only as Required by Law or for \nthe purposes for which it was Disclosed to the person, and the person agrees to notify \nSubcontractor of any instances of which it is aware in which the confidentiality of the information \nhas been breached.\n \ng)\n \nSubcontractor may provide Data Aggregation services relating to the Health Care Operations of \nBusiness Associate.\n \n4.\n \nProvisions for Business Associate to Inform Subcontractor of Privacy Practices and Restrictions\n \na)\n \nBusiness Associate shall notify Subcontractor of any limitations in the Notice of Privacy Practices of \nCovered Entity under 45 CFR 164.520, to the extent that such limitations may affect \nSubcontractor’s Use or Disclosure of PHI.\n \nb)\n \nBusiness Associate shall n\notify Subcontractor of any changes in, or revocation of, the permission by \nan Individual to Use or Disclose his or her PHI, to the extent that such changes may affect \nSubcontractor’s Use or Disclosure of such PHI.\n \nc)\n \nBusiness Associate shall notify Subcontractor of any restriction on the Use or Disclosure of PHI that \nCovered Entity has agreed to or is required to abide by under 45 CFR 164.522, to the extent that \nsuch restriction may affect Subcontractor’s Use or Disclosure of PHI.\n \nd)\n \nUpon request, Business Associate will promptly provide Subcontractor with the Covered Entity’s \nnotice of privacy practices.\n \n5.\n \nPermissible Requests by Business Associate\n \nBusiness Associate shall not request that Subcontractor Use or Disclose PHI in any manner that would no\nt \nbe permissible under Subpart E of 45 CFR Part 164 if done by Business Associate, except that Subcontractor \nmay Use or Disclose PHI for Data Aggregation and for the proper management and administration of \nSubcontractor or to carry out the legal responsibi\nlities of Subcontractor, provided that such uses are \npermitted under the HIPAA Rules, the Massachusetts Data Security Rules and Part 2. \n \n \n6.\n \nTerm and Termination\n \na)\n \nTerm.  The term of this BAA shall be from the Effective Date until all of the Protected Health \nInformation provided by Business Associate to Subcontractor, or created or received by \nSubcontractor on behalf of Business Associate is destroyed or returned to Business Associate. If it is \ninfeasible to return or destroy Protected Health Information, prot\nections are extended to such \ninformation in accordance with the termination provisions in this Section 6.  In addition, certain \nprovisions and requirements of this Agreement shall survive its expiration or other termination.\n \nb)\n \nTermination for Cause.  \n \ni)\n \nBusiness Associate may terminate this BAA and any related Service Agreements if Business \nAssociate determines Subcontractor has breached or violated a material term of this BAA and \nSubcontractor has not cured the breach or ended the violation within the time specified by \nBusiness Associate; provided that in the event of such a breach or violation, Business Associate \nmay, in its sole discretion, terminate this BAA immediately, without providing Subcontractor an \nopportunity to cure the breach or end the violation, \nas applicable.\n  \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":5}}}],["a089c04c-b3ce-4ed9-b441-518b18789961",{"pageContent":"6 \n \nii)\n \nIf Subcontractor knows of a pattern of activity or practice of Business Associate that constitutes \na material breach or violation of Business Associate’s obligations under this Agreement, then \nSubcontractor shall immediately notify Busines\ns Associate.  With respect to such breach or \nviolation, Subcontractor shall: (i) take reasonable steps to cure such breach or end such \nviolation, if possible; or (ii) if such steps are either not possible or are unsuccessful, upon \nwritten notice to Business Associate, terminate its relationship with Business Associate; or (iii) if \nsuch termination is not feasible, report the Business Associate’s breach or violation to the \nSecretary.\n \nc)\n \nObligations of Subcontractor Upon Termination\n.\n \nUpon termination of this BAA\n for any reason, Subcontractor shall:\n \n(i)\n \nExcept as provided in Section 6(c)(ii) below, upon termination of this BAA for any \nreason, Subcontractor shall return or destroy all Protected Health Information \nreceived from Business Associate, or created or received \nby Subcontractor on \nbehalf of Business Associate.  This provision shall apply to Protected Health \nInformation that is in the possession of subcontractors or agents of Subcontractor.  \nSubcontractor shall retain no copies of the Protected Health Information.\n \n(ii)\n \nIn the event that Subcontractor determines that returning or destroying the \nProtected Health Information is infeasible, Subcontractor shall provide to Business \nAssociate notification of the conditions that make return or destruction infeasible.  \nUpon mutual agreement between the Parties that return or destruction of \nProtected Health Information is infeasible, Subcontractor shall extend the \nprotections of this Agreement to such Protected Health Information and limit \nfurther uses and disclosures of such Protected Health Information to those \npurposes that make the return or destruction infeasible, for so long as \nSubcontractor maintains such Protected Health Information.\n \nd)\n \nSurvival\n.    The obligations of Subcontractor under Section 6(c) shall survive the termination of this \nBAA.\n \n7.\n \nIndemnification. \nThe Parties agree to indemnify and hold harmless each other and each other’s \nrespective employees, directors, officers, subcontractors, agents or other members of its \nworkforce, (each an “indemnified party”) against all act\nual and direct losses suffered by the \nindemnified party and all liability to third parties arising from or in connection with any breach of \nthis Agreement or of any warranty hereunder or from any negligence or wrongful acts or omissions \nin relation to this\n Agreement, including failure to perform its obligations under the HIPAA Rules, the \nMassachusetts Data Security Rules and Part 2 by the indemnifying party or its employees, directors, \nofficers, subcontractors, agents or other members of its workforce.  Acc\nordingly, the indemnifying \nparty shall reimburse any indemnified party for any and all actual and direct losses, liabilities, lost \nprofits, fines, penalties, costs or expenses (including reasonable attorneys’ fees) which may for any \nreason be imposed upon any indemnified party by reason of any suit, claim, action, proceeding or \ndemand by any third party which results from the indemnifying party’s breach hereunder.  The ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":6}}}],["9d6d2896-cd6a-459e-b00c-6c6f7518aa58",{"pageContent":"7 \n \nParties’ obligation to indemnify any indemnified party shall survive the expiration or termination of \nthis Agreement for any reason\n \n \n8.\n \nMiscellaneous \n \na)\n \nRegulatory References.  A reference in this BAA to a section in the HIPAA Rules, the Massachusetts \nData Security Rules or Part 2 means the section as in effect or as amended.\n \nb)\n \nAmendment; Waiver\n.  The Parties agree to take such action as is necessary to amend this BAA from \ntime to time as is necessary for compliance with the requirements of the HIPAA Rules and any \nother applicable law. This BAA may not be modified, nor shall any provision hereof be waived or \namended, except in writing duly signed by authorized representatives of both Parties. A waiver with \nrespect to one event shall not be construed as continuing, or as a bar to or waiver of any right or \nremedy as to subsequent events.\n \nc)\n \nInterpretation\n.  Any ambiguity in this BAA shall be interpreted to permit compliance with the   \nHIPAA Rules, the Massachusetts Data Security Rules and Part 2.\n \nd)\n \nConflicts\n.  The terms and conditions of this BAA will override and control any conflicting term or \ncondition of\n any other agreement entered into between Business Associate and Subcontractor.  All \nnon-conflicting terms and conditions of any other agreement entered into between Business \nAssociate and Subcontractor remain in full force and effect.\n \ne)\n \nL\n\nimitation of \nLiability. To the extent the Service Agreements contain a provision limiting the \npotential liability of Subcontractor, such limitation shall not apply to any damages resulting from a \nbreach of this BAA or otherwise contemplated by this BAA, including but n\not limited to those \ncontemplated in Section 2 or Section 7.\n \n \nf)\n \nInsurance\n. Subcontractor shall procure and maintain during the term of this BAA liability insurance \nin accordance with industry standards covering claims for breach of confidentiality and violati\non of \nthe HIPAA Rules, the Massachusetts Data Security Rules and Part 2.  Subcontractor shall notify \nBusiness Associate immediately in the event of a lapse, cancellation, or material modification of \nsuch coverage.\n \n \ng)\n \nSurvival\n. The respective rights and oblig\nations of Subcontractor and Business Associate under \nSections 6 and 7 of this BAA shall survive the termination of this BAA indefinitely.  Further, this BAA \nshall survive with respect to any OHCA Entity, even after termination of the Service Agreements \nand/or this BAA with respect to Business Associate, until (a) there are no remaining arrangements \nbetween Subcontractor and such OHCA Entity pursuant to which Subcontractor creates or receives \nProtected Health Information from or on behalf of such OHCA Entity\n, or (b) Subcontractor and such \nOHCA Entity enter into another agreement addressing the privacy and security of such Protected \nHealth Information.\n \nh)\n \nIn\n\ndependent Relationship\n.  None of the provisions of this BAA are intended to create, nor will they \nbe deemed \nto create, any relationship between Business Associate and Subcontractor other than \nthat of independent parties contracting with each other as independent contractors solely for the \npurposes of effecting the provisions of this BAA.\n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":7}}}],["71831c95-05f5-4985-a062-4d2f766dc290",{"pageContent":"8 \n \ni)\n \nSuccessor and Assigns\n.  This BAA will inure to the benefit of and be binding upon the successors and \nassigns of Business Associate and Subcontractor.  However, this BAA is not assignable by any Party \nwithout the prior written consent of the other Party; provided, however that Bu\nsiness Associate \nmay assign this BAA without consent to any entity controlling, controlled by or under common \ncontrol with Business Associate or any entity which purchases all or substantially all of the assets of \nBusiness Associate.\n \nj)\n \nSeverability. If any provisions of this BAA are unenforceable, invalid or violate applicable law, such \nprovisions shall not affect the enforceability of any other provision of this BAA.\n \nk)\n \nNotices\n.  Any notices to given to a Part under this BAA shall be made to the Party as provi\nded \nbelow:\n \nTo Business Associate:  \n  \nTo Subcontractor:\n \n \nl)\n \nCounterparts; Facsimiles\n.  For the convenience of the Parties, this BAA may be executed in two or \nmore identical counterparts, all of which together shall constitute one agreement.  One or more \ncounterparts of this BAA may be delivered via facsimile, with the intention that they shall have the \nsame effect as an original counterpart. \n \n[signature page follows] \n \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":8}}}],["3d9fd850-bbd0-405d-822c-e82cf547bbb3",{"pageContent":"9 \n \nBusiness Associate:\n \n \n \nSignature:  ____________________________________________\n \n \n \n \n \n \n \nPrinted Name:\n Marian \nDezelan\n \n \n \n \nTitle:  C\nhief \nMarketing \n& \nCommunications \nOfficer\n \n \nSubcontractor:\n \n \n \nSignature:  ____________________________________________\n \n \n \n \n \n \n \nPrinted Name: __________________________________________\n \n \n \n \nTitle:  _________________________________________________\n \n \n \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":9}}}],["2c8e1154-c69f-443b-933c-7191792b17cf",{"pageContent":"10 \n \nEXHIBIT A\n \nOHCA ENTITIES\n \nCAB Health and Recovery Services, Inc.\n \nConcord Specialists, LLC\n \nLahey Clinic Hospital, Inc.\n \nLahey Clinic, Inc.\n \nBeth Israel Lahey Health Primary Care, Inc.\n \nLedgewood Healthcare Corporation \nNortheast Behavioral Health Corporation\n \nNort\nheast Hospital Corporation\n \nNortheast Medical Practice Inc.\n \nNortheast Professional Registry of Nurses, Inc.\n \nNortheast Senior Health Corporation \nSeacoast Nursing and Rehabilitation Center, Inc.\n \nWinchester Hospital \nWinchester Physician Associates Group, LLC\n \nWinchester Physician Associates, Inc.\n \nMount Auburn Hospital\n \nMount Auburn Professional Services, Inc. \nCareGroup Parmenter Home Care & Hospice, Inc.\n \nBeth Israel Deaconess Medical Center, Inc.\n \nBeth Israel Deaconess Hospital –\n Needham, Inc.\n \nBeth Israel Deacones\ns Hospital –\n Milton, Inc.\n \nBeth Israel Deaconess Hospital –\n Plymouth, Inc.\n \nBeth Israel Lahey Health Pharmacy, Inc.\n \nCommunity Physician Associates\n \nBID \n– Milton Physicians Associates, Inc.\n \nMedical Care of Boston Management Corp., d/b/a Beth Israel Deaconess HealthCare a/k/a Affiliated \nPhysicians Group\n \nJordan Physician Associates, Inc.\n \nAnna Jaques Hospital\n \nNew England Baptist Hospital\n \nNew England Baptist Medical Associates, Inc.\n \nNew England Baptist Physician Group, LLC\n \nSeacoast Affiliated Group Practice, Inc.\n \nHarvard Medical Faculty Physicians at Beth Israel Deaconess Medical Center, Inc.\n \n \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Beth Israel BAA.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.6","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"","Author":"Mangalick, Rashi (BILH - Assistant General Counsel)","Subject":"","Keywords":"","Creator":"Acrobat PDFMaker 22 for Word","Producer":"Adobe PDF Library 22.3.39","CreationDate":"D:20221128114120-05'00'","ModDate":"D:20221128114122-05'00'"},"metadata":{"_metadata":{"xmp:modifydate":"2022-11-28T11:41:22-05:00","xmp:createdate":"2022-11-28T11:41:20-05:00","xmp:metadatadate":"2022-11-28T11:41:22-05:00","xmp:creatortool":"Acrobat PDFMaker 22 for Word","xmpmm:documentid":"uuid:57cece8a-c6e8-4e94-99ab-158cc5791090","xmpmm:instanceid":"uuid:985a28f7-b687-4036-a739-11c438522dfe","xmpmm:subject":"2","dc:format":"application/pdf","dc:title":"","dc:description":"","dc:creator":"Mangalick, Rashi (BILH - Assistant General Counsel)","pdf:producer":"Adobe PDF Library 22.3.39","pdf:keywords":"","pdfx:sourcemodified":"D:20221128164113","pdfx:company":"BIDMC","pdfx:comments":""}},"totalPages":10},"loc":{"pageNumber":10}}}]],{"0":"c395e648-eac8-456d-93b5-062b84b850a8","1":"959f986b-eb5d-42c4-b6f9-7315b8e1b593","2":"6bff93ca-d388-40a5-84c7-4460834c378d","3":"0d459d3c-eda4-4d39-abcd-9d989173a955","4":"1df9fcc8-a618-4211-8eb7-1a2b3ecc51aa","5":"a089c04c-b3ce-4ed9-b441-518b18789961","6":"9d6d2896-cd6a-459e-b00c-6c6f7518aa58","7":"71831c95-05f5-4985-a062-4d2f766dc290","8":"3d9fd850-bbd0-405d-822c-e82cf547bbb3","9":"2c8e1154-c69f-443b-933c-7191792b17cf"}]