[[["b3a15787-396d-4f7c-bb77-6a82604c90bc",{"pageContent":" \n \n \n \n \n \n4a, Hamilton House\n \nThe Avenue\n \nLondon\n \nE4 9LD\n \n \nE: \nb.mahmood@stockwoodstrategy.com\n \nT: 020 3640 7759\n \nM: 07714 007 257\n \n \n19\nth\n \nDece\nmber\n \n2022\n \nSunil Patro \n \nFounder \n& CEO \n \nSig\nneasy\n \n750 North St. Paul Street\n \nSte 250\n \nDallas\n \nTX 75201\n \nUSA\n \n \nRe:\n \nStockwood Strategy\n \nAgreement for Professional Services\n \n \nDear\n \nSunil\n:\n \n \n \nThis letter agreement (“Agreement”) sets forth the terms and conditions under which \nStockwood \nStrategy\n \n(“Agency”), agrees to provide public relations and related consulting services to\n \nSigneasy \n(“Client”), effective as of\n \n3\nrd\n \nJanuar\ny 2023 \n(\nthe “Effective Date”).\n \n \n1.\n \nServices\n \n \n \na.   \nAgency shall provide to Client the services set forth in Statement of Work attached hereto.  \nThe \nStatement of Work shall be subject to the terms and conditions set forth herein.\n \nThe services set forth \nin the \nStatement of Work are referred to herein collect\nively, as the “Services”.  \n \n \n2.\n \nCompensation & Expenses\n \n \nFor the Services and outlays on Client’s behalf, Client agrees to pay Agency compensation as \nfollows:\n \n \na.\n \nFee\n.\n  \nThe fee shall be set forth in the SOW.\n \n \n \n3.\n \nBilling\n  \n \n \na.\n \nAgency shall bill Client \nat the end of the project \nfor the Fee\n, as per budget notes in the \nscope of work\n. Payment is due no later than \nseven\n \n(\n7\n) days from the invoice date.  \n \n \n4.   \n \nTerm; Termination\n \n \na.\n \nThis Agreement is effective as of the Effective Date first stated above and will continue in \nfull force and effect until \neither party gives the other party at least\n \nfourteen\n \n(\n14\n) days’ prior written notice \nto terminate\n.  Either party may terminate this Agr\neement by providing\n \nthe other party at least \nfourteen (14\n) \ndays’ prior written notice to terminate. During any notice period, the Agreement will remain in full force \nand effect and the rights, duties and responsibilities of Ag\nency and Client shall continue\n \nuntil the end of \nthe  notice  period\n. \nWith  respect  to  the  notice  period,  Agency  will  be  entitled  to  receive,  all  fees  due  to \nAgency \nfor the \nfourteen \n(\n14\n) day period up to and including the notice period calculated on a  pro rata \nbasis. The entire period dur\ning which this Agreement is in effect is referred to herein as the “Term”.\n \n \n5\n.   \n \nConfidentiality\n.   \n \n \nEach party (the “Receiving Party”) will treat as confidential and properly safeguard any and all information, \ndocuments, papers, programs and ideas relating to the other party (the “Disclosing Party”), its operations, \nfinances  and  products,  disclosed  to  th\ne  Receiving  Party  and  designated  by  the  Disclosing  Party  as ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Stockwood Strategy and Signeast contract_19th December 2022.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.7","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":" ","Author":"Bilal","Subject":" ","Keywords":" ","Creator":"Microsoft® Word 2021","Producer":"PSPDFKit","CreationDate":"D:20221219154428+00'00'","ModDate":"D:20221223191307Z"},"metadata":{"_metadata":{"pdf:producer":"Microsoft® Word 2021","pdf:keywords":"","dc:title":"","dc:creator":"Bilal","dc:description":"","xmp:creatortool":"Microsoft® Word 2021","xmp:createdate":"2022-12-19T15:44:28+00:00","xmp:modifydate":"2022-12-19T15:44:28+00:00","xmpmm:documentid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515","xmpmm:instanceid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515"}},"totalPages":5},"loc":{"pageNumber":1}}}],["86455ac8-55a0-45db-ada7-5dd4c79fce35",{"pageContent":" \n \n \n \n \nconfidential or which should be reasonably understood to be confidential (“Confidential Information”).  \nConfidential  Information  shall  not  include  information  that  (a)  is  or  falls  into  the  public \ndomain;  (b)  is \ndisclosed to the Receiving Party by a third party which is not under an obligation of confidentiality to the \nDisclosing Party; (c) was already known to the Receiving Party; and/or (d) is independently developed by \nthe  Receiving  Party  without\n \nreference  to  Confidential  Information.    In  the  event  the  Receiving  Party  is \nrequired by a subpoena or other legal process to disclose the Disclosing Party’s Confidential Information, \nthe Receiving Party shall: (i) if legally permitted, inform the Disclosi\nng Party of such requirement; and (ii) \nonly provide such Confidential Information of the Disclosing Party that is legally required.  In the course \nof performing the Services, Agency may disclose Confidential Information as Client shall have approved \nfor di\nsclosure.  This provision shall survive the termination of this Agreement and shall remain in full force \nand effect for a period of three (3) years following the completion of Services.\n \n \n6\n.\n \nOwnership; Use Of Materials\n.  \n \n \na.\n \nAs between Agency and \nClient, Client shall be sole owner\n \nof all rights in and to materials \ndeveloped and produced by Agency on Client’s behalf, provided Client has paid all invoices due and owing \nto  Agency  pursuant  to  this  Agreement.    Notwithstanding  anything  to  the  contrary  he\nrein,  Client \nunderstands  and  agrees  that  its  rights  in  any  third  party  materials  or  any  services  including,  without \nlimitation,  stock  photos,  licensed  materials  or  talent  and  talent  residuals,  are  subject  to  any  terms  and \nconditions set forth in any \nthis\n \na\ngreement.  \n \n \nb.\n \nNotwithstanding anything in this Agreement to the contrary, Agency retains all of its rights, \ntitle and interest in and to (including, without limitation, the unlimited right to use) (i) all materials owned \nby or licensed to Agency prior to\n, or independent from, the performance of services under this Agreement, \nand all modifications thereof, and (ii) all generic or proprietary information, and all ideas, methodologies, \nsoftware,  applications,  processes  or  procedures  used,  created  or  develope\nd  by  Agency  in  the  general \nconduct of its business.\n \nThis Clause shall not include any of the Confidential Information or proprietary \ninformation supplied by the Client and any of the products and deliverables that the Agency had created \nsolely or jointly w\nith third parties for the purposes of this Agreement.\n \nAny product created by the Agency \nand any third party for the purposes of this Agreement shall be the sole property of the Client.    \n \n \n7\n.\n \nC\nlient Obligations\n. \n \n \nClient shall be responsible for: (a) the accuracy, completeness and propriety of information concerning \nClient’s  organisation,  products,  services  and  Client’s  competitors’  products  and  services,  whether \nprovided to Agency by Client or by a third party Auth\norised by Client; (b) the accuracy, completeness and \npropriety of any ideas or directions, whether provided to Agency by Client or by a third party Authorised \nby Client; (c) rights, licenses and permissions to use materials furnished to Agency by Client or\n \nby a third \nparty on Client’s behalf; (d) compliance with all laws and regulations applicable to Client’s business \n(including all securities laws); and \n© \nthe content of any press releases or other disseminated statements, \ninformation or materials approved \nby Client.\n \n \n \n8\n.\n \nLimitation Of Liability\n.  \n \n \nIn \nno  event  whatsoever  shall  either  party  be  liable  to  the  other  hereunder  for  any  incidental,  indirect, \nspecial, consequential or punitive damages or lost profits under any tort, contract, strict liability or ot\nher \nlegal or equitable theory arising out of or pertaining to the subject matter of this Agreement, even if said \nparty has been advised of the possibility of or could have foreseen such damages.  This Section 11 shall \nsurvive the termination of this Agreem\nent.\n \n \n9\n.\n \nModification of Plans\n.  \n \n \nClient reserves the right to modify, revise, or cancel any plans, schedules, or work, and in the event\n \nClient \nnotifies Agency that Client wishes to do so, Agency will take steps as soon as practicable to give effect to \nClient’s instructions.  In connection with any such modification, revision or cancellation, Client agrees to \npay Agency according to the te\nrms of this Agreement for any work done, including but not limited to (a) \nreimbursing Agency for all expenses incurred prior to the effective date of such modification, revision or \ncancellation; (b) assuming Agency’s liability for all contracts and commitm\nents Agency is unable to cancel; \nand  (c)  reimbursing  Agency  for  any  cancellation  penalties  incurred.    In  addition,  in  the  event  of  a \nmodification  revision  or  cancellation,  Client  shall  indemnify,  defend  and  hold  Agency  harmless  for  all \nLosses that result f\nrom carrying out Client’s instructions.\n \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Stockwood Strategy and Signeast contract_19th December 2022.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.7","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":" ","Author":"Bilal","Subject":" ","Keywords":" ","Creator":"Microsoft® Word 2021","Producer":"PSPDFKit","CreationDate":"D:20221219154428+00'00'","ModDate":"D:20221223191307Z"},"metadata":{"_metadata":{"pdf:producer":"Microsoft® Word 2021","pdf:keywords":"","dc:title":"","dc:creator":"Bilal","dc:description":"","xmp:creatortool":"Microsoft® Word 2021","xmp:createdate":"2022-12-19T15:44:28+00:00","xmp:modifydate":"2022-12-19T15:44:28+00:00","xmpmm:documentid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515","xmpmm:instanceid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515"}},"totalPages":5},"loc":{"pageNumber":2}}}],["1a1f0598-85fc-4305-84f6-ae678ade1733",{"pageContent":" \n \n \n \n \n \n1\n0\n.\n \nUse of Materials By Third Parties.\n  \n \n \nAfter material has been issued by Agency to the news media or to another third party, its use is no longer \nunder Agency’s control.  Agency cannot assure the use of news mat\nerial  by  any  news  organisation.  \nSimilarly, Agency cannot control the form or manner of use by the news media or others of the material, \nincluding,  but  not  limited  to,  the  accurate  presentation  of  information  supplied  by  Agency\n \n(unless  such \ninaccuracy resu\nlted from acts or omissions of the Agency which has not been approved by the Client)\n.\n  \nIt \nis understood and agreed that Agency does not stipulate or guarantee specific or overall results or returns \nfrom public relations, publicity, research or  any other ac\ntivity performed by Agency\n \nunless such results \nare caused directly as a consequence of the acts or omissions of the Agency.\n \n \n1\n1\n.\n \nForce Majeure\n.  \n \n \nNeither  party  shall  be  liable  for  any  delay  or  failure  to  carry  out  or  make  continuously  available  its \nobligations under this Agreement if such delay or failure is due to any cause beyond such party’s control, \nincluding without limitation restrictions of law or regulations, labor disputes, acts of God, acts of terrorism \nor  war,  telecommunications,  network  o\nr  power  failures  or  interruptions,  or  mechanical  or  electronic \nbreakdowns.\n \n \n12\n.\n \nPublicity\n. \n \n \n \nAgency may use Client’s name and any non\n-\nconfidential  materials  produced  hereunder  in  Agency's \nportfolio, on Agency's web site, intranet, and for internal and tra\nde purposes. Agency will be required to \nobtain  Client's  advance  approval  to  utilise  Client's  trademarks  or  any  Client  materials  or  information  in \npress releases, Agency brochures, or award submissions.\n \n \n1\n3\n.\n \nEntire Agreement; Severability\n.  \n \n \nThis  Agreement\n \nconstitutes  the  parties’  entire  understanding  of  the  matters  set  forth  herein  and \nsupersedes any prior understanding or agreement concerning the subject matter hereof.   This Agreement \nmay  only  be  modified  in  a  writing  signed  by  the  parties  hereto.  In  the\n \nevent  that  any  provision  of  this \nAgreement shall be illegal or otherwise unenforceable, such provision shall be severed, and the balance \nof the Agreement shall continue in full force and effect.\n \n \n \nIf the above meets with your approval, kindly \nindicate your consent by signing both enclosed originals of \nthis letter where indicated, return one to us and retain the other for your files.\n \n \nYours sincerely,\n \n \n \n \n \n \n \nStockwood Strategy\n \n \n \n \nBy:\n \n \n \nDate:\n \n \n \n \n \n \n \n \n \nName: \nBilal\n \nMahmood\n \n \nTitle: \nConsultant \n \n \n \n \n \n \nACCEPTED AND AGREED\n \n \nSigneas\ny\n \n \n \n \nBy:\n \n \n \nDate:\n \n \n \n \n \n \n \n \n        \nName: \nS\nunil Patr\no \n \n        \nTitle:\n \nFounder and CEO \n \n \n \n \n \n \n12/19/22\n12/23/22","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Stockwood Strategy and Signeast contract_19th December 2022.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.7","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":" ","Author":"Bilal","Subject":" ","Keywords":" ","Creator":"Microsoft® Word 2021","Producer":"PSPDFKit","CreationDate":"D:20221219154428+00'00'","ModDate":"D:20221223191307Z"},"metadata":{"_metadata":{"pdf:producer":"Microsoft® Word 2021","pdf:keywords":"","dc:title":"","dc:creator":"Bilal","dc:description":"","xmp:creatortool":"Microsoft® Word 2021","xmp:createdate":"2022-12-19T15:44:28+00:00","xmp:modifydate":"2022-12-19T15:44:28+00:00","xmpmm:documentid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515","xmpmm:instanceid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515"}},"totalPages":5},"loc":{"pageNumber":3}}}],["c2e4844e-5624-459c-86e4-1257cd4b14ee",{"pageContent":" \n \n \n \n \nSi\ngn\neasy \n \n \nProposed \nStatement of Work\n \n \nReference is made to the Letter Agreement between \nStockwood Strategy\n \n(“Agency”)\n \nand\n \nS\nigneasy \n(\n“Client”), effective as of\n \n3\nrd\n \nJ\nanuary \n2\n02\n3\n \n(the “Agreement”).  This Statement of Work (“SOW”), dated\n \n19\nth\n \nDece\nmber \n2\n022,\n \nis governed by the terms and conditions of the Agreement.  All terms used herein and not \notherwise defined herein are used as defined in the Agreement. \n \n \nIntroduction\n \nSigneasy is set to announce a significant business milestone event. They would like to use media relations \nto communicate this to \nstakeholders and raise the profile of the brand to business and tech audiences. It has \nbeen agreed that a concerted media relations\n-\nled approach is required to secure top tier press coverage \nwith global media titles.\n \n \n \nStrategy\n \n \nIn delivering a targeted a\nnd managed approach to achieve the communications objective, the following \napproach is advised:\n \n \nThe business should communicate an announcement to the industry. This will provide the opportunity to \nengage the media to tell the backstory of the company, s\nhowcase the platform / market opportunity and \nbroadcast its ambitions. This will attract media attention. Importantly, this exercise will provide a stepping \nstone for ongoing media engagement.\n   \n \n \nThe announcement will be executed by means of a press rele\nase and preceding that, a pre\n-\nbriefing \ncampaign (ahead of launch day) to top tier media titles. These titles will include (and not limited to): \nTechCrunch, VentureBeat, Axios, TNW, Forbes, Fortune, Fast Company, Entrepreneur.com, CNBC among \nother top tier \ntech industry titles including industry media.\n \n \n \nPlanning:\n \n•\n \nAnnouncement date is to be confirmed (possibly January or February 2023)\n \n•\n \nBilal to source and set up a media list covering relevant sector journalists and media titles\n \n•\n \nBilal to create a media pitch list for pre\n-\nbriefing media. These journalists will receive the press \nrelease (under embargo)\n \n \n•\n \nBilal and team to create a Slack / Wh\natsApp group to expedite actions\n \n \nTactics\n \n \nIn delivering the objectives and strategy, the following approach will be taken. The schedule below is \nadvised, it can be changed depending on timelines.\n \n \n \nw/c 9th January 2023\n \n \n•\n \nBilal and team to create a Slack \n/ WhatsApp group to expedite actions\n \n•\n \nBilal to review and advise on the media announcement (the press release). Everyone to input and \nsupport\n \n•\n \nBilal to review media assets (images, social handles, spokesperson biog etc) as required.\n \n \n•\n \nBilal to create a master\n \nmedia list for distribution of the press release. From this, Bilal select key \nmedia titles for pre\n-\nbriefing\n \n \n \nw/c 16th January 2023\n \n \n•\n \nTeam to agree final version of press release\n  \n \n•\n \nBilal to start pre\n-\nbriefing journalists on the news (under embargo) and ar\nrange press interviews \nwhere required\n \n•\n \nBilal to reach out for TechCrunch exclusive and Forbes interview among others\n \n \n•\n \nBilal to secure TechCrunch and Forbes then rally other media around this.\n \n \n \nw/c 22nd January 2023 (launch week)\n \n \n•\n \nBilal to continue briefi\nng journalists on the news (under embargo) and arrange press interviews \nwhere required.\n \n \n•\n \nOn launch day, expect media coverage from key media pre\n-\nbriefing list\n \n \n•\n \nOn launch day, Bilal to distribute press release to a master media list\n  \n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Stockwood Strategy and Signeast contract_19th December 2022.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.7","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":" ","Author":"Bilal","Subject":" ","Keywords":" ","Creator":"Microsoft® Word 2021","Producer":"PSPDFKit","CreationDate":"D:20221219154428+00'00'","ModDate":"D:20221223191307Z"},"metadata":{"_metadata":{"pdf:producer":"Microsoft® Word 2021","pdf:keywords":"","dc:title":"","dc:creator":"Bilal","dc:description":"","xmp:creatortool":"Microsoft® Word 2021","xmp:createdate":"2022-12-19T15:44:28+00:00","xmp:modifydate":"2022-12-19T15:44:28+00:00","xmpmm:documentid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515","xmpmm:instanceid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515"}},"totalPages":5},"loc":{"pageNumber":4}}}],["9c62ce43-ab7a-4eab-b6eb-210b3504126f",{"pageContent":" \n \n \n \n \n•\n \nIn addition to the media list, Bilal to use NewsDirect for wire distribution on the day (to boost wider \nmedia coverage \n-\n \nUS only)\n \n•\n \nBilal to monitor for press mentions and share with t\nhe team.\n \n \n \nFebruary 2023\n \nBilal to:\n \n•\n \nCreate a media pitch note for journalists and share with the team. Team to agree final version of the \nmedia pitch note\n \n \n•\n \nCreate a master media list for distribution of the media pitch note.\n \n•\n \nDistribute media pitch note and\n \nmonitor for opportunities\n \n \n•\n \nFollow up on pitch note to media\n \n \n•\n \nMonitor for opportunities and share with the team\n \n \n•\n \nLook out for podcast, profile, feature and comment opps from the outreach.\n \n \n \nOverall outcomes\n \nIt is anticipated that a concerted media\n-\nrelatio\nns led approach will:\n  \n \n1.\n \nGenerate greater awareness among journalists,\n \n \n2.\n \nGenerate highly visible but also targeted and meaningful profile pieces and news articles in the \nmedia \n-\n \nearned press mentions (coverage)\n \n3.\n \nHeightened awareness of the brand\n \n4.\n \nAttract top t\nier talent to the business; and with\n \n5.\n \nTop of funnel / engagement (business / investor / partnership) opportunities\n \n \n \nBudget\n \n \n \nItem\n \nCost\n \nBilal time \n-\n \nadvisory / planning / execution for the milestone announcement. \n \nThis will include: media lists, wire, media monitoring and social listening tools.\n \n \n£7,500\n \nMedia pitching in February 2023\n \n£5,000\n \nBonus for securing TechCrunch\n \n£2,500\n \nTotal\n \n£15\n,000\n \n \n \nTerm of project: \n                  \n \nStart Date:\n \n \n \n \n \n9th January 2023\n \n                    \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nEnd Date: \n \n \n \n \n \n3rd March 2023\n \n \n \nTotal Estimated Amount:\n \n£15,000.00 (assuming bonus is secured). 7 days from invoice date.\n \n \nAdditional Terms and Conditions: \nNone\n \n \nBy their signatures below, the parties are \nagreeing to the terms of this SOW.\n \n \nStockwood Strategy\n \n \n \nBy:\n \n \n \nDate:\n \n \n \n \n \n \n \n \n \nName: \nBilal\n \nMahmood\n \n \nTitle: \nConsultant \n \n \n \n \n \n \nACCEPTED AND AGREED\n \n \nSigneas\ny\n \n \n \nBy:\n \n \n \nDate:\n \n \n \n \n \n \n \n \n        \nName: \nS\nunil Patr\no \n \n        \nTitle:\n \nFounder and CEO \n \n12/19/22\n12/23/22","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Stockwood Strategy and Signeast contract_19th December 2022.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.7","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":" ","Author":"Bilal","Subject":" ","Keywords":" ","Creator":"Microsoft® Word 2021","Producer":"PSPDFKit","CreationDate":"D:20221219154428+00'00'","ModDate":"D:20221223191307Z"},"metadata":{"_metadata":{"pdf:producer":"Microsoft® Word 2021","pdf:keywords":"","dc:title":"","dc:creator":"Bilal","dc:description":"","xmp:creatortool":"Microsoft® Word 2021","xmp:createdate":"2022-12-19T15:44:28+00:00","xmp:modifydate":"2022-12-19T15:44:28+00:00","xmpmm:documentid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515","xmpmm:instanceid":"uuid:D33A45A8-AF91-4DB5-B82A-12A695069515"}},"totalPages":5},"loc":{"pageNumber":5}}}]],{"0":"b3a15787-396d-4f7c-bb77-6a82604c90bc","1":"86455ac8-55a0-45db-ada7-5dd4c79fce35","2":"1a1f0598-85fc-4305-84f6-ae678ade1733","3":"c2e4844e-5624-459c-86e4-1257cd4b14ee","4":"9c62ce43-ab7a-4eab-b6eb-210b3504126f"}]