[[["21d9397d-c010-44e3-8e61-a5b42fb39d9d",{"pageContent":"CONFIDENTIAL\n \n \nThis Agreement is made and entered into as of the last date signed below (the “Effective Date”) by and between \nGlykka\n \nLLC\n \n(\ndba\n \nSign\ne\nasy)\n \n,\n \na\n \nTX\n \nLLC\n \ncorporation\n \nhaving its principal place of business at \n1601\n \nElm\n \nStreet\n, \nDallas\n, \nTX\n \n75201\n \n(\nThe\n \n“\nCompany\n\")  and \nFoo\nBar\n_\nI\nnc\n____\n____________________\n___\n,\n \na  _____\nC\nalifornia\n______ \ncorporation\n/individual\n \nwhose \nprincipal \nmail\ning \naddress \nis \n_\n_\nSan \nFrancisco, \nCA, \nUSA\n___________________________,\n \n(the \"Second\n \nParty\").\n \n \nWHEREAS \nThe\n \nCompany\n \nand  the  Second  Party  (the  “Parties”)  have  an  interest  in  participating  in \ndiscussions wherein either Party might share information with the other that the disclosing Party considers to be \nproprietary and confidential to itself (“Confidential Information”)\n; and\n \n \nWHEREAS the Parties agree that Confidential Information of a Party might include, but not be limited to \nthat  Party’s:  (1)  business  plans,  methods,  and  practices;  (2)  personnel,  customers,  and  suppliers;  (3)  inventions, \nprocesses,  methods,  products, \npatent  applications,  and  other  proprietary  rights;  or  (4)  specifications,  drawings, \nsketches, models, samples, tools, computer programs, technical information, or other related information; \n \n \nNOW, THEREFORE, the Parties agree as follows:\n \n1.\n \nEither  Party  may  d\nisclose  Confidential  Information  to  the  other  Party  in  confidence  provided  that  the \ndisclosing Party identifies such information as proprietary and confidential either by marking it, in the case of written \nmaterials, or, in the case of information that is \ndisclosed orally or written materials that are not marked, by notifying \nthe other Party of the proprietary and confidential nature of the information, such notification to be done orally, by e\n-\nmail or written correspondence, or via other means of communica\ntion as might be appropriate.\n \n2.\n \nWhen informed of the proprietary and confidential nature of Confidential Information that has been disclosed \nby the other Party, the receiving Party (“Recipient”) shall, for a period of \ntwo (2\n) years from the date of disclosur\ne, \nrefrain from disclosing such Confidential Information to any contractor or other third party without prior, written \napproval from the disclosing Party and shall protect such Confidential Information from inadvertent disclosure to a \nthird party using the\n \nsame care and diligence that the Recipient uses to protect its own proprietary and confidential \ninformation, but in no case less than reasonable care.  The Recipient shall ensure that each of its employees, officers, \ndirectors, or agents who has access to\n \nConfidential Information disclosed under this Agreement is informed of its \nproprietary  and  confidential  nature  and  is  required  to  abide  by  the  terms  of  this  Agreement.    The  Recipient  of \nConfidential Information disclosed under this Agreement shall promptl\ny notify the disclosing Party of any disclosure \nof such Confidential Information in violation of this Agreement or of any subpoena or other legal process requiring \nproduction or disclosure of said Confidential Information.\n \n3.\n \nAll  Confidential  Information  disc\nlosed  under  this  Agreement  shall  be  and  remain  the  property  of  the \ndisclosing Party and nothing contained in this Agreement shall be construed as granting or conferring any rights to \nsuch Confidential Information on the other Party.  The Recipient shall ho\nnor any request from the disclosing Party to \npromptly return or destroy all copies of Confidential Information disclosed under this Agreement and all notes related \nto  such  Confidential  Information.    The  Parties  agree  that  the  disclosing  Party  will  suffer  i\nrreparable  injury  if  its \nConfidential Information is made public, released to a third party, or otherwise disclosed in breach of this Agreement \nand that the disclosing Party shall be entitled to obtain injunctive relief against a threatened breach or conti\nnuation of \nany such breach and, in the event of such breach, an award of actual and exemplary damages from any court of \ncompetent jurisdiction.\n \n4.\n \nThe terms of this Agreement shall not be construed to limit either Party’s right to develop independently or \nacq\nuire products without use of the other Party’s Confidential Information. The disclosing party acknowledges that \nthe Recipient may currently or in the future be developing information internally, or receiving information from other \nparties, that is similar \nto the Confidential Information. Nothing in this Agreement will prohibit the Recipient from \ndeveloping or having developed for it products, concepts, systems or techniques that are similar to or compete with \nthe products, concepts, systems or techniques co\nntemplated by or embodied in the Confidential Information provided \nthat the Recipient does not violate any of its obligations under this Agreement in connection with such development.\n \n5.\n \nNotwithstanding the above, the Parties agree that information shall not \nbe deemed Confidential Information \nand the Recipient shall have no obligation to hold in confidence such information, where such information:\n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Mutual_NDA_Signeasy_demo.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.3","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"Mutual_NDA_SignEasy_sample1","Author":"Sunil Patro","Creator":"Word","Producer":"macOS Version 12.6.3 (Build 21G419) Quartz PDFContext","CreationDate":"D:20230601034811Z00'00'","ModDate":"D:20230601034811Z00'00'"},"metadata":null,"totalPages":2},"loc":{"pageNumber":1}}}],["2aeeed4c-f0f3-4347-8ac3-a3fdb89767fa",{"pageContent":"Non\n-\nDisclosure Agreement\n \n-\nPage \n2\n \nof \n2\n-\n \nCONFIDENTIAL\n \n \n(a)\n \nIs already known to the Recipient, having been disclosed to the Recipient by a third party without such \nthird part\ny having an obligation of confidentiality to the disclosing Party; or\n \n(b)\n \nIs  or  becomes  publicly  known  through  no  wrongful  act  of  the  Recipient,  its  employees,  officers, \ndirectors, or agents; or \n \n(c)\n \nIs  independently  developed  by  the  Recipient  without  reference  to\n \nany  Confidential  Information \ndisclosed hereunder; or\n \n(d)\n \nIs approved for release (and only to the extent so approved) by the disclosing Party; or\n \n(e)\n \nIs disclosed pursuant to the lawful requirement of a court or governmental agency or where required \nby operation \nof law.\n \n6.\n \nNothing in this Agreement shall be construed to constitute an agency, partnership, joint venture, or other \nsimilar relationship between the Parties.\n \n7.\n \nNeither Party will, without prior approval of the other Party, make any public \nannouncement of or otherwise \ndisclose the existence or the terms of this Agreement.\n \n8.\n \nThis Agreement contains the entire agreement between the Parties and in no way creates an obligation for \neither Party to disclose information to the other Party or to enter\n \ninto any other agreement.\n \n9.\n \nThis Agreement shall remain \nin effect for a period of \ntwo (2\n) years from the Effective Date unless otherwise \nterminated by either Party giving notice to the other of its desire to terminate this Agreement.  The requirement to \npro\ntect Confidential Information disclosed under this Agreement shall survive termination of this Agreement.\n \n \n \nI\nN WITNESS WHEREOF:\n \n \n \nGLYKKA LLC \n(DBA SIGNEASY)\n \nCOMPANY\n/INDIVIDUAL\n \n \n \n \n \n \n \nSignature\n \n \nSignature\n \n \nSUNIL \nPATRO\n \n \n \nJANE SMITH\n \n     \n                     \nPrinted Name\n \n           \n           \nPrinted Name\n \nCEO\n \n \n \nGENERAL COUNSEL\n \n         \n                      \nTitle\n \n           \n                 \nTitle\n \n \n \n \n \nDated: \n \n0\n5/30/23\n ","metadata":{"source":"/Users/arvindgirish/Documents/Projects/langchain-js-server/uploads/Mutual_NDA_Signeasy_demo.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.3","IsAcroFormPresent":false,"IsXFAPresent":false,"Title":"Mutual_NDA_SignEasy_sample1","Author":"Sunil Patro","Creator":"Word","Producer":"macOS Version 12.6.3 (Build 21G419) Quartz PDFContext","CreationDate":"D:20230601034811Z00'00'","ModDate":"D:20230601034811Z00'00'"},"metadata":null,"totalPages":2},"loc":{"pageNumber":2}}}]],{"0":"21d9397d-c010-44e3-8e61-a5b42fb39d9d","1":"2aeeed4c-f0f3-4347-8ac3-a3fdb89767fa"}]